Австралия/src/DataProcessors/ProductCartForExternalUsers/ProductCartForExternalUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ProductCartForExternalUsers</name>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PricePeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AmountIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKindCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>DynamicPriceKindPercent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DynamicPriceKindBasic</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountCard</name>
    <type>
      <types>CatalogRef.DiscountCards</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPercentByDiscountCard</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PriceCalculationMethod</name>
    <type>
      <types>EnumRef.PriceCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Ref</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ShoppingCart</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Factor</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DiscountMarkupPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsBundle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>StructuralUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Австралия/src/DataProcessors/ProductCartForExternalUsers/Forms/QuantityAndPrice/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Products = Parameters.Products;
	Quantity = Parameters.Quantity;
	MeasurementUnit = Parameters.MeasurementUnit;
	Factor = Parameters.Factor;
	Price = Parameters.Price;
	
	SetFormItemsProperties(Parameters.SelectionSettingsCache);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	AmountCalculation();
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure QuantityOnChange(Item)
	
	AmountCalculation();
	
EndProcedure

&AtClient
Procedure MeasurementUnitOnChange(Item)
	
	If TypeOf(MeasurementUnit) = Type("CatalogRef.UOM")
		And ValueIsFilled(MeasurementUnit) Then
		
		NewFactor = GetUOMFactor(MeasurementUnit);
		
	Else
		
		NewFactor = 1;
		
	EndIf;
	
	If Factor <> 0 And Price <> 0 Then
		
		Price = Price * NewFactor / Factor;
		
	EndIf;
	
	Factor = NewFactor;
	
	AmountCalculation();
	
EndProcedure

&AtClient
Procedure PriceOnChange(Item)
	
	AmountCalculation();
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure OK(Command)
	
	Result = New Structure;
	
	Result.Insert("Quantity", Quantity);
	Result.Insert("MeasurementUnit", MeasurementUnit);
	Result.Insert("Factor", Factor);
	Result.Insert("Price", Price);
	
	Close(Result);
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Procedure SetFormItemsProperties(SelectionSettingsCache)
	
	PriceEnabled = (SelectionSettingsCache.RequestPrice And SelectionSettingsCache.AllowedToChangeAmount);
	
	CommonClientServer.SetFormItemProperty(Items, "QuantityGroup", "Enabled", SelectionSettingsCache.RequestQuantity);
	CommonClientServer.SetFormItemProperty(Items, "Price", "Enabled", PriceEnabled);
	
	If SelectionSettingsCache.RequestQuantity Then
		If PriceEnabled Then
			TitleText = NStr("en = 'Input quantity and price'; ru = 'Запрашивать количество и цену';pl = 'Wprowadź ilość i cenę';es_ES = 'Cantidad de entrada y precio';es_CO = 'Cantidad de entrada y precio';tr = 'Miktar ve fiyat gir';it = 'Inserisci quantità e prezzo';de = 'Eingabemenge und -preis'");
		Else
			TitleText = NStr("en = 'Input quantity'; ru = 'Запрашивать количество';pl = 'Wprowadź ilość';es_ES = 'Cantidad de entrada';es_CO = 'Cantidad de entrada';tr = 'Miktar gir';it = 'Inserisci quantità';de = 'Eingabemenge'");
		EndIf;
	Else
		TitleText = NStr("en = 'Input price'; ru = 'Запрашивать цену';pl = 'Wprowadź cenę';es_ES = 'Precio de entrada';es_CO = 'Precio de entrada';tr = 'Fiyat gir';it = 'Inserisci prezzo';de = 'Eingabepreis'");
	EndIf;
	
	Title = TitleText;
	
EndProcedure

&AtClient
Procedure AmountCalculation()
	Amount = Quantity * Price;
EndProcedure

&AtServerNoContext
Function GetUOMFactor(MeasurementUnit)
	
	Return MeasurementUnit.Factor;
	
EndFunction

#EndRegion
